![Ironhack Logo](https://i.imgur.com/1QgrNNw.png)

In [7]:
import pymongo
import pandas as pd
from pymongo import MongoClient
client=MongoClient()
db=client.DB

# Answers
### 1. All the companies that it's name match 'Babelgum'. Retrieve only their `name` field.

In [10]:
a = db.db.find({'name':'Babelgum'},{'name':1})
ax = pd.DataFrame(a)
ax.head()

                        _id      name
0  52cdef7c4bab8bd675297da0  Babelgum

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [27]:
b = db.db.find({'number_of_employees':{'$gt':5000}},{'name':1,'number_of_employees':1,'_id':0}).limit(20).sort("number_of_employees", pymongo.DESCENDING)
bx = pd.DataFrame(b)
bx
#se identificó que el registro 16 y 17 (Mitsubishi Electric) están repetidos, pero cuentan con diferente '_id'.
# No se va a borrar para no afectar la base de datos general, por el momento.

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                     Comcast               100000
19                                 Bertelsmann               100000

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fileds.

In [33]:
c = db.db.find({'founded_year':{'$gte':2000, '$lte':2005}},
               {'name':1,'founded_year':1,'_id':0})
cx = pd.DataFrame(c)
cx.head()

        name  founded_year
0   Wetpaint          2005
1       Zoho          2005
2       Digg          2004
3   Facebook          2004
4  Omnidrive          2005

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [44]:
d = db.db.find({'ipo.valuation_amount':{'$gt':100000},'founded_year':{'$lt':2010}}
               ,{'name':1,'ipo':1,'_id':0})
dx = pd.DataFrame(d)
dx.head()

       name                                                ipo
0  Facebook  {'valuation_amount': 104000000000, 'valuation_...
1   Twitter  {'valuation_amount': 18100000000, 'valuation_c...
2      Yelp  {'valuation_amount': 1300000000, 'valuation_cu...
3  LinkedIn  {'valuation_amount': 9310000000, 'valuation_cu...
4    Amazon  {'valuation_amount': 100000000000, 'valuation_...

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

### 6. All the companies that don't include the `partners` field.

### 7. All the companies that have a null type of value on the `category_code` field.

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

### 9. Order all the companies by their IPO price descendently.

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

### 11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

### 12. All the companies that have been 'deadpooled' after the third year.

### 13. All the companies founded before 2000 that have and acquisition amount of more than 10.000.000

### 14. All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their `name` and `acquisiton` field.

### 15. Order the companies by their `founded year`, retrieving only their `name` and `founded year`.

### 16. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their `aquisition price` descendently. Limit the search to 10 documents.

### 17. All the companies on the 'web' `category` that have more than 4000 employees. Sort them by the amount of employees in ascendant order.

### 18. All the companies which their acquisition amount is more than 10.000.000, and currency are 'EUR'.

### 19. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their `name` and `acquisition` fields.

### 20. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.